{
  "id": "recipe_004",
  "name": "Coconut Chicken Curry",
  "ingredients": [
    {
      "amount": "2 1/2",
      "unit": "pounds",
      "description": "boneless, skinless chicken thighs"
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "description": "ground paprika"
    },
    {
      "amount": "1/2",
      "unit": "teaspoon",
      "description": "ground turmeric"
    },
    {
      "amount": "2",
      "unit": "teaspoons",
      "description": "kosher salt, plus more as needed"
    },
    {
      "amount": "1/3",
      "unit": "cup",
      "description": "canola oil"
    },
    {
      "amount": "2",
      "unit": "",
      "description": "yellow onions, finely diced"
    },
    {
      "amount": "4",
      "unit": "",
      "description": "garlic cloves, minced"
    },
    {
      "amount": "1",
      "unit": "(13-ounce) can",
      "description": "unsweetened coconut milk"
    },
    {
      "amount": "1 1/2",
      "unit": "tablespoons",
      "description": "fish sauce, plus more as needed"
    },
    {
      "amount": "1",
      "unit": "teaspoon",
      "description": "Madras curry powder"
    },
    {
      "amount": "1/2",
      "unit": "teaspoon",
      "description": "ground cayenne"
    },
    {
      "amount": "1",
      "unit": "cup",
      "description": "cilantro sprigs, for serving"
    },
    {
      "amount": "1",
      "unit": "",
      "description": "lime or lemon, cut into wedges, for serving"
    }
  ],
  "instructions": "Step 1\r\nTrim the chicken thighs of excess fat and cut into ½- to 1-inch\r\npieces; transfer to a bowl. Add the paprika, turmeric and salt, and\r\nuse your hands to mix well. Let the chicken marinate at room\r\ntemperature while you prepare the other ingredients, or cover\r\nand refrigerate overnight.\r\n\r\nStep 2\r\nIn a large pot, heat the oil over medium-high. Stir in the onions,\r\nlower the heat to medium-low and cook gently, stirring often to\r\nprevent scorching, until tender and translucent, 8 to 10 minutes.\r\nAdd the garlic and continue to cook, stirring often, until most of\r\nthe water from the onions has been cooked out and a glossy layer\r\nof oil has risen to the surface, about 5 minutes more.\r\n\r\nStep 3\r\nAdd the marinated chicken and stir to release the spices into the\r\nonion. Pour in the coconut milk and bring to a near boil. Let the\r\ncoconut milk simmer briskly for about 4 minutes to thicken a bit.\r\nLower the heat to medium-low and add the fish sauce. Stir in 1½\r\ncups water and bring to a near boil. The broth will thin out as the\r\nchicken starts to release its juices.\r\n\r\nStep 4\r\nLower to a gentle simmer and cook, stirring occasionally, until the\r\nchicken is tender, 30 to 45 minutes. Droplets of paprika-red oil will\r\nrise to the surface. Stir in the curry powder and cayenne, simmer\r\nbriefly and remove from the heat.\r\n\r\nStep 5\r\nIf time permits, let the curry sit for at least 20 minutes before\r\nserving. This allows the chicken to soak in more flavors as the\r\ncurry cools. Bring to a simmer again right before serving and\r\ntaste, adding more salt or fish sauce if desired. Serve over rice or\r\nnoodles, with bowls of cilantro and lime wedges.",
  "notes": "Curry powder is stirred into this braise only during the last minute of cooking, delivering a bright hit of\r\nspice on top of the paprika and turmeric mellowed into the slow-simmered chicken. This dish from\r\n“Burma Superstar” by Desmond Tan and Kate Leahy (Ten Speed Press, 2017), needs time on the\r\nstove but not much attention, and gets even better after resting in the fridge, making it an ideal\r\nweeknight meal that can last days. Thereʼs plenty of coconut milk broth to spoon over rice or noodles.\r\nAt his restaurant, Burma Superstar in Oakland, Calif., Mr. Tan also serves this with platha, a buttery, flaky Burmese flatbread, for dipping.",
  "tags": [
    "CURRY",
    "CHICKEN",
    "COCONUT",
    "BURMESE",
    "MAIN COURSE"
  ],
  "created_at": "2025-10-21T15:12:48.749166",
  "updated_at": "2025-10-21T15:12:48.749180",
  "user_id": null,
  "rating": null,
  "favorites": [],
  "source": {
    "name": "Burma Superstar",
    "url": "",
    "author": "Desmond Tan and Kate Leahy",
    "issue": ""
  }
}