{
  "id": "recipe_004",
  "name": "Creamy Cavatappi",
  "ingredients": [
    {
      "amount": "8",
      "unit": "ounces",
      "description": "cavatappi pasta"
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "description": "unsalted butter"
    },
    {
      "amount": "2",
      "unit": "cloves",
      "description": "garlic, minced"
    },
    {
      "amount": "3/4",
      "unit": "cup",
      "description": "heavy cream"
    },
    {
      "amount": "1/2",
      "unit": "teaspoon",
      "description": "kosher salt, plus more for the pasta water"
    },
    {
      "amount": "1/2",
      "unit": "teaspoon",
      "description": "finely ground black pepper"
    },
    {
      "amount": "1/2",
      "unit": "cup",
      "description": "finely grated Parmesan cheese, plus more for garnish"
    },
    {
      "amount": "1",
      "unit": "tablespoon",
      "description": "fresh lemon juice"
    },
    {
      "amount": "1",
      "unit": "cup",
      "description": "frozen peas, optional"
    },
    {
      "amount": "1/4",
      "unit": "cup",
      "description": "reserved pasta cooking water"
    },
    {
      "amount": "1/2",
      "unit": "cup",
      "description": "reserved pasta cooking water"
    }
  ],
  "instructions": "1. Put a large pot of water on to boil over high heat. Season generously with salt.\r\n\r\n2. Once the water is boiling, add the pasta and stir. Cook until just short of al dente, according to the package directions.\r\n\r\n3. While the pasta cooks, add the butter to a large skillet over medium heat. Once melted, add the garlic and cook just until fragrant but not browned, about 30 seconds.\r\n\r\n4. Slowly add the cream while stirring and season with salt and pepper. Bring to a simmer, reducing the heat if needed to maintain a simmer. Cook, while stirring, until slightly thickened, about 3 minutes.\r\n\r\n5. Add the Parmesan a small handful at a time, sprinkling it over top and stirring each time until melted. Add the lemon juice and stir. Turn the heat as low as it’ll go until the pasta is ready, stirring occasionally.\r\n\r\n6. Reserve 1/2 cup of the pasta water. Add the frozen peas to a colander.\r\n\r\n7. Drain the pasta over the frozen peas (the hot pasta will help defrost the peas).\r\n\r\n8. If your skillet is big enough, add the pasta and peas to the sauce. Otherwise, add the pasta and peas back to the pasta pot and pour the sauce over the top.\r\n\r\n9. Add 1/4 cup of the reserved pasta water and turn the heat to medium. Toss constantly until you have a creamy sauce that coats the noodles, 3 to 5 minutes. If the sauce seems too thick, add more pasta water a small splash at a time, tossing in between.\r\n\r\n10. Taste, adding salt and/or pepper if needed. Top with a sprinkle of Parmesan cheese and serve immediately.",
  "notes": "Creamy cavatappi is best eaten hot and freshly made, but you can refrigerate it in an airtight container for up to 3 days. Reheat gently in the microwave or on the stovetop, adding a little water or cream to loosen the sauce.\r\n\r\nThe amount of salt is a guideline—adjust it based on your taste and how salty your pasta water is.\r\n\r\nYou’ll want the sauce slightly looser than you think since it will thicken quickly as it cools.",
  "tags": [
    "PASTA",
    "CREAMY",
    "QUICK",
    "ITALIAN",
    "DINNER",
    "COMFORT FOOD"
  ],
  "created_at": "2025-10-19T11:30:40.141820",
  "updated_at": "2025-10-19T11:30:40.141834",
  "user_id": null,
  "rating": null,
  "favorites": [],
  "source": {
    "name": "Simply Recipes",
    "url": "https://www.simplyrecipes.com/creamy-cavatappi-recipe-7503493",
    "author": "Laurel Randolph",
    "issue": ""
  }
}